logs/benchmark_1mw(2017-11-17_20h58)/ratio_1:0/sharded_false/workers_32/clients_32/client_1_1_3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:     1055083 ops,   11357 (avg:   11722) ops/sec, 11.53MB/sec (avg: 11.90MB/sec),  5.64 (avg:  5.45) msec latency

2         Threads
32        Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets       11593.93          ---          ---      5.45300     12051.23
Gets           0.00         0.00         0.00      0.00000         0.00
Waits          0.00          ---          ---      0.00000          ---
Totals     11593.93         0.00         0.00      5.45300     12051.23


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.300         0.00
SET       1.400         0.00
SET       1.500         0.00
SET       1.600         0.01
SET       1.700         0.01
SET       1.800         0.03
SET       1.900         0.05
SET       2.000         0.10
SET       2.100         0.17
SET       2.200         0.29
SET       2.300         0.47
SET       2.400         0.72
SET       2.500         1.08
SET       2.600         1.54
SET       2.700         2.11
SET       2.800         2.87
SET       2.900         3.80
SET       3.000         4.96
SET       3.100         6.35
SET       3.200         7.99
SET       3.300         9.98
SET       3.400        12.25
SET       3.500        14.81
SET       3.600        17.61
SET       3.700        20.64
SET       3.800        23.77
SET       3.900        26.99
SET       4.000        30.30
SET       4.100        33.52
SET       4.200        36.60
SET       4.300        39.44
SET       4.400        41.99
SET       4.500        44.24
SET       4.600        46.26
SET       4.700        48.09
SET       4.800        49.68
SET       4.900        51.10
SET       5.000        52.35
SET       5.100        53.50
SET       5.200        54.55
SET       5.300        55.54
SET       5.400        56.51
SET       5.500        57.46
SET       5.600        58.45
SET       5.700        59.50
SET       5.800        60.59
SET       5.900        61.85
SET       6.000        63.17
SET       6.100        64.65
SET       6.200        66.23
SET       6.300        67.89
SET       6.400        69.61
SET       6.500        71.42
SET       6.600        73.18
SET       6.700        74.95
SET       6.800        76.69
SET       6.900        78.41
SET       7.000        80.03
SET       7.100        81.59
SET       7.200        83.05
SET       7.300        84.41
SET       7.400        85.70
SET       7.500        86.87
SET       7.600        87.91
SET       7.700        88.86
SET       7.800        89.72
SET       7.900        90.49
SET       8.000        91.19
SET       8.100        91.85
SET       8.200        92.43
SET       8.300        92.98
SET       8.400        93.48
SET       8.500        93.92
SET       8.600        94.32
SET       8.700        94.68
SET       8.800        95.03
SET       8.900        95.35
SET       9.000        95.62
SET       9.100        95.89
SET       9.200        96.12
SET       9.300        96.35
SET       9.400        96.55
SET       9.500        96.74
SET       9.600        96.93
SET       9.700        97.08
SET       9.800        97.24
SET       9.900        97.38
SET      10.000        98.01
SET      11.000        98.73
SET      12.000        99.14
SET      13.000        99.38
SET      14.000        99.55
SET      15.000        99.66
SET      16.000        99.74
SET      17.000        99.80
SET      18.000        99.85
SET      19.000        99.88
SET      20.000        99.91
SET      21.000        99.93
SET      22.000        99.95
SET      23.000        99.96
SET      24.000        99.96
SET      25.000        99.98
SET      26.000        99.99
SET      27.000        99.99
SET      28.000        99.99
SET      29.000        99.99
SET      30.000        99.99
SET      31.000        99.99
SET      32.000        99.99
SET      33.000        99.99
SET      35.000        99.99
SET      36.000        99.99
SET      37.000        99.99
SET      38.000        99.99
SET      39.000       100.00
SET      41.000       100.00
SET      42.000       100.00
SET      46.000       100.00
SET      47.000       100.00
SET      48.000       100.00
SET      56.000       100.00
SET      57.000       100.00
SET      58.000       100.00
SET      60.000       100.00
SET      67.000       100.00
SET      69.000       100.00
SET      73.000       100.00
SET     210.000       100.00
SET     220.000       100.00
SET     230.000       100.00
---
---